#ifndef __FONTMANAGER_H__
#define __FONTMANAGER_H__

#include "DxLib.h"

//-----------------------------------------------------------------------------
// フォント管理構造体
//-----------------------------------------------------------------------------
struct GameFonts {
	int mainFont;
	// 他に必要なフォントがあればここに追加
};

//-----------------------------------------------------------------------------
// 関数宣言
//-----------------------------------------------------------------------------
void LoadFonts();
void DeleteFonts();

extern GameFonts gameFonts;

#endif